stm32-rs/stm32f4xx-hal/src/gpio.rs
                    /// Configures the pin to operate in AF3 mode
                    pub fn into_alternate_af3(
                        self,
                    ) -> $PXi<Alternate<AF3>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af3()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF4 mode
                    pub fn into_alternate_af4(
                        self,
                    ) -> $PXi<Alternate<AF4>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af4()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF5 mode
                    pub fn into_alternate_af5(
                        self,
                    ) -> $PXi<Alternate<AF5>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af5()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF6 mode
                    pub fn into_alternate_af6(
                        self,
                    ) -> $PXi<Alternate<AF6>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af6()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF7 mode
                    pub fn into_alternate_af7(
                        self,
                    ) -> $PXi<Alternate<AF7>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af7()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF8 mode
                    pub fn into_alternate_af8(
                        self,
                    ) -> $PXi<Alternate<AF8>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af8()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF9 mode
                    pub fn into_alternate_af9(
                        self,
                    ) -> $PXi<Alternate<AF9>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af9()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF10 mode
                    pub fn into_alternate_af10(
                        self,
                    ) -> $PXi<Alternate<AF10>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af10()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF11 mode
                    pub fn into_alternate_af11(
                        self,
                    ) -> $PXi<Alternate<AF11>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af11()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF12 mode
                    pub fn into_alternate_af12(
                        self,
                    ) -> $PXi<Alternate<AF12>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af12()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF13 mode
                    pub fn into_alternate_af13(
                        self,
                    ) -> $PXi<Alternate<AF13>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af13()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate in AF14 mode
                    pub fn into_alternate_af14(
                        self,
                    ) -> $PXi<Alternate<AF14>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af14()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

