stm32-rs/stm32f4xx-hal/src/gpio.rs
                    /// Configures the pin to operate in AF15 mode
                    pub fn into_alternate_af15(
                        self,
                    ) -> $PXi<Alternate<AF15>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().alternate()
                            });
                            &(*$GPIOX::ptr()).$afrx.modify(|_, w| {
                                w.$afrxi().af15()
                            });
                        }

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate as a floating input pin
                    pub fn into_floating_input(
                        self,
                    ) -> $PXi<Input<Floating>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().input()
                            });
                            &(*$GPIOX::ptr()).pupdr.modify(|_, w| {
                                w.$pupdri().floating()
                            });
                        };

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate as a pulled down input pin
                    pub fn into_pull_down_input(
                        self,
                    ) -> $PXi<Input<PullDown>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().input()
                            });
                            &(*$GPIOX::ptr()).pupdr.modify(|_, w| {
                                w.$pupdri().pull_down()
                            });
                        };

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate as a pulled up input pin
                    pub fn into_pull_up_input(
                        self,
                    ) -> $PXi<Input<PullUp>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().input()
                            });
                            &(*$GPIOX::ptr()).pupdr.modify(|_, w| {
                                w.$pupdri().pull_up()
                            });
                        };

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate as an open drain output pin
                    pub fn into_open_drain_output(
                        self,
                    ) -> $PXi<Output<OpenDrain>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().output()
                            });
                            &(*$GPIOX::ptr()).pupdr.modify(|_, w| {
                                w.$pupdri().floating()
                            });
                            &(*$GPIOX::ptr()).otyper.modify(|_, w| {
                                w.$oti().open_drain()
                            });
                        };

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate as an push pull output pin
                    pub fn into_push_pull_output(
                        self,
                    ) -> $PXi<Output<PushPull>> {
                        unsafe {
                            &(*$GPIOX::ptr()).moder.modify(|_, w| {
                                w.$moderi().output()
                            });
                            &(*$GPIOX::ptr()).pupdr.modify(|_, w| {
                                w.$pupdri().floating()
                            });
                            &(*$GPIOX::ptr()).otyper.modify(|_, w| {
                                w.$oti().push_pull()
                            });
                        };

                        $PXi { _mode: PhantomData }
                    }

                    /// Set pin speed
                    pub fn set_speed(self, speed: Speed) -> Self {
                        unsafe {
                            &(*$GPIOX::ptr()).ospeedr.modify(|_, w| {
                                w.$ospeedri().bits(speed as u8)
                            });
                        };

                        self
                    }
                }

                impl $PXi<Output<OpenDrain>> {
                    /// Enables / disables the internal pull up
                    pub fn internal_pull_up(&mut self, on: bool) {
                        unsafe {
                            &(*$GPIOX::ptr()).pupdr.modify(|_, w| {
                                if on { w.$pupdri().pull_up() }
                                else  { w.$pupdri().floating() }
                            });
                        };
                    }
                }

                impl<MODE> $PXi<Alternate<MODE>> {
                    /// Enables / disables the internal pull up
                    pub fn internal_pull_up(self, on: bool) -> Self {
                        unsafe {
                            &(*$GPIOX::ptr()).pupdr.modify(|_, w| {
                                if on { w.$pupdri().pull_up() }
                                else  { w.$pupdri().floating() }
                            });
                        };

                        self
                    }
                }

                impl<MODE> $PXi<Alternate<MODE>> {
                    /// Turns pin alternate configuration pin into open drain
                    pub fn set_open_drain(self) -> Self {
                        unsafe {
                            &(*$GPIOX::ptr()).otyper.modify(|_, w| {
                                w.$oti().open_drain()
                            });
                        };

                        self
                    }
                }

                impl<MODE> $PXi<Output<MODE>> {
                    /// Erases the pin number from the type
                    ///
                    /// This is useful when you want to collect the pins into an array where you
                    /// need all the elements to have the same type
                    pub fn downgrade(self) -> $PXx<Output<MODE>> {
                        $PXx {
                            i: $i,
                            _mode: self._mode,
                        }
                    }
                }

