stm32-rs/stm32f4xx-hal/src/gpio.rs
                impl<MODE> OutputPin for $PXi<Output<MODE>> {
                    fn set_high(&mut self) {
                        // NOTE(unsafe) atomic write to a stateless register
                        unsafe { (*$GPIOX::ptr()).bsrr.write(|w| w.$bsi().set()) }
                    }

                    fn set_low(&mut self) {
                        // NOTE(unsafe) atomic write to a stateless register
                        unsafe { (*$GPIOX::ptr()).bsrr.write(|w| w.$bri().reset()) }
                    }
                }

                impl<MODE> InputPin for $PXi<Output<MODE>> {
                    fn is_high(&self) -> bool {
                        !self.is_low()
                    }

                    fn is_low(&self) -> bool {
                        // NOTE(unsafe) atomic read with no side effects
                        unsafe { (*$GPIOX::ptr()).idr.read().$idri().is_low() }
                    }
                }

                impl<MODE> $PXi<Input<MODE>> {
                    /// Erases the pin number from the type
                    ///
                    /// This is useful when you want to collect the pins into an array where you
                    /// need all the elements to have the same type
                    pub fn downgrade(self) -> $PXx<Input<MODE>> {
                        $PXx {
                            i: $i,
                            _mode: self._mode,
                        }
                    }
                }

                impl<MODE> InputPin for $PXi<Input<MODE>> {
                    fn is_high(&self) -> bool {
                        !self.is_low()
                    }

                    fn is_low(&self) -> bool {
                        // NOTE(unsafe) atomic read with no side effects
                        unsafe { (*$GPIOX::ptr()).idr.read().$idri().is_low() }
                    }
                }
            )+

                impl<TYPE> $PXx<TYPE> {
                    pub fn get_id (&self) -> u8
                    {
                        self.i
                    }
                }
        }
    }
}

gpio!(GPIOA, gpioa, gpioaen, PA, [
    PA0: (pa0, 0, moder0, ot0, ospeedr0, pupdr0, idr0, bs0, br0, afrl, afrl0, Input<Floating>),
    PA1: (pa1, 1, moder1, ot1, ospeedr1, pupdr1, idr1, bs1, br1, afrl, afrl1, Input<Floating>),
    PA2: (pa2, 2, moder2, ot2, ospeedr2, pupdr2, idr2, bs2, br2, afrl, afrl2, Input<Floating>),
    PA3: (pa3, 3, moder3, ot3, ospeedr3, pupdr3, idr3, bs3, br3, afrl, afrl3, Input<Floating>),
    PA4: (pa4, 4, moder4, ot4, ospeedr4, pupdr4, idr4, bs4, br4, afrl, afrl4, Input<Floating>),
    PA5: (pa5, 5, moder5, ot5, ospeedr5, pupdr5, idr5, bs5, br5, afrl, afrl5, Input<Floating>),
    PA6: (pa6, 6, moder6, ot6, ospeedr6, pupdr6, idr6, bs6, br6, afrl, afrl6, Input<Floating>),
    PA7: (pa7, 7, moder7, ot7, ospeedr7, pupdr7, idr7, bs7, br7, afrl, afrl7, Input<Floating>),
    PA8: (pa8, 8, moder8, ot8, ospeedr8, pupdr8, idr8, bs8, br8, afrh, afrh8, Input<Floating>),
    PA9: (pa9, 9, moder9, ot9, ospeedr9, pupdr9, idr9, bs9, br9, afrh, afrh9, Input<Floating>),
    PA10: (pa10, 10, moder10, ot10, ospeedr10, pupdr10, idr10, bs10, br10, afrh, afrh10, Input<Floating>),
    PA11: (pa11, 11, moder11, ot11, ospeedr11, pupdr11, idr11, bs11, br11, afrh, afrh11, Input<Floating>),
    PA12: (pa12, 12, moder12, ot12, ospeedr12, pupdr12, idr12, bs12, br12, afrh, afrh12, Input<Floating>),
    PA13: (pa13, 13, moder13, ot13, ospeedr13, pupdr13, idr13, bs13, br13, afrh, afrh13, Input<Floating>),
    PA14: (pa14, 14, moder14, ot14, ospeedr14, pupdr14, idr14, bs14, br14, afrh, afrh14, Input<Floating>),
    PA15: (pa15, 15, moder15, ot15, ospeedr15, pupdr15, idr15, bs15, br15, afrh, afrh15, Input<Floating>),
]);

gpio!(GPIOB, gpiob, gpioben, PB, [
    PB0: (pb0, 0, moder0, ot0, ospeedr0, pupdr0, idr0, bs0, br0, afrl, afrl0, Input<Floating>),
    PB1: (pb1, 1, moder1, ot1, ospeedr1, pupdr1, idr1, bs1, br1, afrl, afrl1, Input<Floating>),
    PB2: (pb2, 2, moder2, ot2, ospeedr2, pupdr2, idr2, bs2, br2, afrl, afrl2, Input<Floating>),
    PB3: (pb3, 3, moder3, ot3, ospeedr3, pupdr3, idr3, bs3, br3, afrl, afrl3, Input<Floating>),
    PB4: (pb4, 4, moder4, ot4, ospeedr4, pupdr4, idr4, bs4, br4, afrl, afrl4, Input<Floating>),
    PB5: (pb5, 5, moder5, ot5, ospeedr5, pupdr5, idr5, bs5, br5, afrl, afrl5, Input<Floating>),
    PB6: (pb6, 6, moder6, ot6, ospeedr6, pupdr6, idr6, bs6, br6, afrl, afrl6, Input<Floating>),
    PB7: (pb7, 7, moder7, ot7, ospeedr7, pupdr7, idr7, bs7, br7, afrl, afrl7, Input<Floating>),
    PB8: (pb8, 8, moder8, ot8, ospeedr8, pupdr8, idr8, bs8, br8, afrh, afrh8, Input<Floating>),
    PB9: (pb9, 9, moder9, ot9, ospeedr9, pupdr9, idr9, bs9, br9, afrh, afrh9, Input<Floating>),
    PB10: (pb10, 10, moder10, ot10, ospeedr10, pupdr10, idr10, bs10, br10, afrh, afrh10, Input<Floating>),
    PB11: (pb11, 11, moder11, ot11, ospeedr11, pupdr11, idr11, bs11, br11, afrh, afrh11, Input<Floating>),
    PB12: (pb12, 12, moder12, ot12, ospeedr12, pupdr12, idr12, bs12, br12, afrh, afrh12, Input<Floating>),
    PB13: (pb13, 13, moder13, ot13, ospeedr13, pupdr13, idr13, bs13, br13, afrh, afrh13, Input<Floating>),
    PB14: (pb14, 14, moder14, ot14, ospeedr14, pupdr14, idr14, bs14, br14, afrh, afrh14, Input<Floating>),
    PB15: (pb15, 15, moder15, ot15, ospeedr15, pupdr15, idr15, bs15, br15, afrh, afrh15, Input<Floating>),
]);

gpio!(GPIOC, gpioc, gpiocen, PC, [
    PC0: (pc0, 0, moder0, ot0, ospeedr0, pupdr0, idr0, bs0, br0, afrl, afrl0, Input<Floating>),
    PC1: (pc1, 1, moder1, ot1, ospeedr1, pupdr1, idr1, bs1, br1, afrl, afrl1, Input<Floating>),
    PC2: (pc2, 2, moder2, ot2, ospeedr2, pupdr2, idr2, bs2, br2, afrl, afrl2, Input<Floating>),
    PC3: (pc3, 3, moder3, ot3, ospeedr3, pupdr3, idr3, bs3, br3, afrl, afrl3, Input<Floating>),
    PC4: (pc4, 4, moder4, ot4, ospeedr4, pupdr4, idr4, bs4, br4, afrl, afrl4, Input<Floating>),
    PC5: (pc5, 5, moder5, ot5, ospeedr5, pupdr5, idr5, bs5, br5, afrl, afrl5, Input<Floating>),
    PC6: (pc6, 6, moder6, ot6, ospeedr6, pupdr6, idr6, bs6, br6, afrl, afrl6, Input<Floating>),
    PC7: (pc7, 7, moder7, ot7, ospeedr7, pupdr7, idr7, bs7, br7, afrl, afrl7, Input<Floating>),
    PC8: (pc8, 8, moder8, ot8, ospeedr8, pupdr8, idr8, bs8, br8, afrh, afrh8, Input<Floating>),
    PC9: (pc9, 9, moder9, ot9, ospeedr9, pupdr9, idr9, bs9, br9, afrh, afrh9, Input<Floating>),
    PC10: (pc10, 10, moder10, ot10, ospeedr10, pupdr10, idr10, bs10, br10, afrh, afrh10, Input<Floating>),
    PC11: (pc11, 11, moder11, ot11, ospeedr11, pupdr11, idr11, bs11, br11, afrh, afrh11, Input<Floating>),
    PC12: (pc12, 12, moder12, ot12, ospeedr12, pupdr12, idr12, bs12, br12, afrh, afrh12, Input<Floating>),
    PC13: (pc13, 13, moder13, ot13, ospeedr13, pupdr13, idr13, bs13, br13, afrh, afrh13, Input<Floating>),
    PC14: (pc14, 14, moder14, ot14, ospeedr14, pupdr14, idr14, bs14, br14, afrh, afrh14, Input<Floating>),
    PC15: (pc15, 15, moder15, ot15, ospeedr15, pupdr15, idr15, bs15, br15, afrh, afrh15, Input<Floating>),
]);

gpio!(GPIOD, gpiod, gpioden, PD, [
    PD0: (pd0, 0, moder0, ot0, ospeedr0, pupdr0, idr0, bs0, br0, afrl, afrl0, Input<Floating>),
    PD1: (pd1, 1, moder1, ot1, ospeedr1, pupdr1, idr1, bs1, br1, afrl, afrl1, Input<Floating>),
    PD2: (pd2, 2, moder2, ot2, ospeedr2, pupdr2, idr2, bs2, br2, afrl, afrl2, Input<Floating>),
    PD3: (pd3, 3, moder3, ot3, ospeedr3, pupdr3, idr3, bs3, br3, afrl, afrl3, Input<Floating>),
    PD4: (pd4, 4, moder4, ot4, ospeedr4, pupdr4, idr4, bs4, br4, afrl, afrl4, Input<Floating>),
    PD5: (pd5, 5, moder5, ot5, ospeedr5, pupdr5, idr5, bs5, br5, afrl, afrl5, Input<Floating>),
    PD6: (pd6, 6, moder6, ot6, ospeedr6, pupdr6, idr6, bs6, br6, afrl, afrl6, Input<Floating>),
    PD7: (pd7, 7, moder7, ot7, ospeedr7, pupdr7, idr7, bs7, br7, afrl, afrl7, Input<Floating>),
    PD8: (pd8, 8, moder8, ot8, ospeedr8, pupdr8, idr8, bs8, br8, afrh, afrh8, Input<Floating>),
    PD9: (pd9, 9, moder9, ot9, ospeedr9, pupdr9, idr9, bs9, br9, afrh, afrh9, Input<Floating>),
    PD10: (pd10, 10, moder10, ot10, ospeedr10, pupdr10, idr10, bs10, br10, afrh, afrh10, Input<Floating>),
    PD11: (pd11, 11, moder11, ot11, ospeedr11, pupdr11, idr11, bs11, br11, afrh, afrh11, Input<Floating>),
    PD12: (pd12, 12, moder12, ot12, ospeedr12, pupdr12, idr12, bs12, br12, afrh, afrh12, Input<Floating>),
    PD13: (pd13, 13, moder13, ot13, ospeedr13, pupdr13, idr13, bs13, br13, afrh, afrh13, Input<Floating>),
    PD14: (pd14, 14, moder14, ot14, ospeedr14, pupdr14, idr14, bs14, br14, afrh, afrh14, Input<Floating>),
    PD15: (pd15, 15, moder15, ot15, ospeedr15, pupdr15, idr15, bs15, br15, afrh, afrh15, Input<Floating>),
]);

gpio!(GPIOE, gpioe, gpioeen, PE, [
    PE0: (pe0, 0, moder0, ot0, ospeedr0, pupdr0, idr0, bs0, br0, afrl, afrl0, Input<Floating>),
    PE1: (pe1, 1, moder1, ot1, ospeedr1, pupdr1, idr1, bs1, br1, afrl, afrl1, Input<Floating>),
    PE2: (pe2, 2, moder2, ot2, ospeedr2, pupdr2, idr2, bs2, br2, afrl, afrl2, Input<Floating>),
    PE3: (pe3, 3, moder3, ot3, ospeedr3, pupdr3, idr3, bs3, br3, afrl, afrl3, Input<Floating>),
    PE4: (pe4, 4, moder4, ot4, ospeedr4, pupdr4, idr4, bs4, br4, afrl, afrl4, Input<Floating>),
    PE5: (pe5, 5, moder5, ot5, ospeedr5, pupdr5, idr5, bs5, br5, afrl, afrl5, Input<Floating>),
    PE6: (pe6, 6, moder6, ot6, ospeedr6, pupdr6, idr6, bs6, br6, afrl, afrl6, Input<Floating>),
    PE7: (pe7, 7, moder7, ot7, ospeedr7, pupdr7, idr7, bs7, br7, afrl, afrl7, Input<Floating>),
    PE8: (pe8, 8, moder8, ot8, ospeedr8, pupdr8, idr8, bs8, br8, afrh, afrh8, Input<Floating>),
    PE9: (pe9, 9, moder9, ot9, ospeedr9, pupdr9, idr9, bs9, br9, afrh, afrh9, Input<Floating>),
    PE10: (pe10, 10, moder10, ot10, ospeedr10, pupdr10, idr10, bs10, br10, afrh, afrh10, Input<Floating>),
    PE11: (pe11, 11, moder11, ot11, ospeedr11, pupdr11, idr11, bs11, br11, afrh, afrh11, Input<Floating>),
    PE12: (pe12, 12, moder12, ot12, ospeedr12, pupdr12, idr12, bs12, br12, afrh, afrh12, Input<Floating>),
    PE13: (pe13, 13, moder13, ot13, ospeedr13, pupdr13, idr13, bs13, br13, afrh, afrh13, Input<Floating>),
    PE14: (pe14, 14, moder14, ot14, ospeedr14, pupdr14, idr14, bs14, br14, afrh, afrh14, Input<Floating>),
    PE15: (pe15, 15, moder15, ot15, ospeedr15, pupdr15, idr15, bs15, br15, afrh, afrh15, Input<Floating>),
]);

