stm32-rs/stm32f4xx-hal/src/gpio.rs
#[cfg(any(feature = "stm32f407", feature = "stm32f412", feature = "stm32f429"))]
gpio!(GPIOF, gpiof, gpiofen, PF, [
    PF0: (pf0, 0, moder0, ot0, ospeedr0, pupdr0, idr0, bs0, br0, afrl, afrl0, Input<Floating>),
    PF1: (pf1, 1, moder1, ot1, ospeedr1, pupdr1, idr1, bs1, br1, afrl, afrl1, Input<Floating>),
    PF2: (pf2, 2, moder2, ot2, ospeedr2, pupdr2, idr2, bs2, br2, afrl, afrl2, Input<Floating>),
    PF3: (pf3, 3, moder3, ot3, ospeedr3, pupdr3, idr3, bs3, br3, afrl, afrl3, Input<Floating>),
    PF4: (pf4, 4, moder4, ot4, ospeedr4, pupdr4, idr4, bs4, br4, afrl, afrl4, Input<Floating>),
    PF5: (pf5, 5, moder5, ot5, ospeedr5, pupdr5, idr5, bs5, br5, afrl, afrl5, Input<Floating>),
    PF6: (pf6, 6, moder6, ot6, ospeedr6, pupdr6, idr6, bs6, br6, afrl, afrl6, Input<Floating>),
    PF7: (pf7, 7, moder7, ot7, ospeedr7, pupdr7, idr7, bs7, br7, afrl, afrl7, Input<Floating>),
    PF8: (pf8, 8, moder8, ot8, ospeedr8, pupdr8, idr8, bs8, br8, afrh, afrh8, Input<Floating>),
    PF9: (pf9, 9, moder9, ot9, ospeedr9, pupdr9, idr9, bs9, br9, afrh, afrh9, Input<Floating>),
    PF10: (pf10, 10, moder10, ot10, ospeedr10, pupdr10, idr10, bs10, br10, afrh, afrh10, Input<Floating>),
    PF11: (pf11, 11, moder11, ot11, ospeedr11, pupdr11, idr11, bs11, br11, afrh, afrh11, Input<Floating>),
    PF12: (pf12, 12, moder12, ot12, ospeedr12, pupdr12, idr12, bs12, br12, afrh, afrh12, Input<Floating>),
    PF13: (pf13, 13, moder13, ot13, ospeedr13, pupdr13, idr13, bs13, br13, afrh, afrh13, Input<Floating>),
    PF14: (pf14, 14, moder14, ot14, ospeedr14, pupdr14, idr14, bs14, br14, afrh, afrh14, Input<Floating>),
    PF15: (pf15, 15, moder15, ot15, ospeedr15, pupdr15, idr15, bs15, br15, afrh, afrh15, Input<Floating>),
]);

#[cfg(any(feature = "stm32f407", feature = "stm32f412", feature = "stm32f429"))]
gpio!(GPIOG, gpiog, gpiogen, PG, [
    PG0: (pg0, 0, moder0, ot0, ospeedr0, pupdr0, idr0, bs0, br0, afrl, afrl0, Input<Floating>),
    PG1: (pg1, 1, moder1, ot1, ospeedr1, pupdr1, idr1, bs1, br1, afrl, afrl1, Input<Floating>),
    PG2: (pg2, 2, moder2, ot2, ospeedr2, pupdr2, idr2, bs2, br2, afrl, afrl2, Input<Floating>),
    PG3: (pg3, 3, moder3, ot3, ospeedr3, pupdr3, idr3, bs3, br3, afrl, afrl3, Input<Floating>),
    PG4: (pg4, 4, moder4, ot4, ospeedr4, pupdr4, idr4, bs4, br4, afrl, afrl4, Input<Floating>),
    PG5: (pg5, 5, moder5, ot5, ospeedr5, pupdr5, idr5, bs5, br5, afrl, afrl5, Input<Floating>),
    PG6: (pg6, 6, moder6, ot6, ospeedr6, pupdr6, idr6, bs6, br6, afrl, afrl6, Input<Floating>),
    PG7: (pg7, 7, moder7, ot7, ospeedr7, pupdr7, idr7, bs7, br7, afrl, afrl7, Input<Floating>),
    PG8: (pg8, 8, moder8, ot8, ospeedr8, pupdr8, idr8, bs8, br8, afrh, afrh8, Input<Floating>),
    PG9: (pg9, 9, moder9, ot9, ospeedr9, pupdr9, idr9, bs9, br9, afrh, afrh9, Input<Floating>),
    PG10: (pg10, 10, moder10, ot10, ospeedr10, pupdr10, idr10, bs10, br10, afrh, afrh10, Input<Floating>),
    PG11: (pg11, 11, moder11, ot11, ospeedr11, pupdr11, idr11, bs11, br11, afrh, afrh11, Input<Floating>),
    PG12: (pg12, 12, moder12, ot12, ospeedr12, pupdr12, idr12, bs12, br12, afrh, afrh12, Input<Floating>),
    PG13: (pg13, 13, moder13, ot13, ospeedr13, pupdr13, idr13, bs13, br13, afrh, afrh13, Input<Floating>),
    PG14: (pg14, 14, moder14, ot14, ospeedr14, pupdr14, idr14, bs14, br14, afrh, afrh14, Input<Floating>),
    PG15: (pg15, 15, moder15, ot15, ospeedr15, pupdr15, idr15, bs15, br15, afrh, afrh15, Input<Floating>),
]);

#[cfg(any(feature = "stm32f407", feature = "stm32f412", feature = "stm32f429", feature = "stm32f411"))]
gpio!(GPIOH, gpioh, gpiohen, PH, [
    PH0: (ph0, 0, moder0, ot0, ospeedr0, pupdr0, idr0, bs0, br0, afrl, afrl0, Input<Floating>),
    PH1: (ph1, 1, moder1, ot1, ospeedr1, pupdr1, idr1, bs1, br1, afrl, afrl1, Input<Floating>),
    PH2: (ph2, 2, moder2, ot2, ospeedr2, pupdr2, idr2, bs2, br2, afrl, afrl2, Input<Floating>),
    PH3: (ph3, 3, moder3, ot3, ospeedr3, pupdr3, idr3, bs3, br3, afrl, afrl3, Input<Floating>),
    PH4: (ph4, 4, moder4, ot4, ospeedr4, pupdr4, idr4, bs4, br4, afrl, afrl4, Input<Floating>),
    PH5: (ph5, 5, moder5, ot5, ospeedr5, pupdr5, idr5, bs5, br5, afrl, afrl5, Input<Floating>),
    PH6: (ph6, 6, moder6, ot6, ospeedr6, pupdr6, idr6, bs6, br6, afrl, afrl6, Input<Floating>),
    PH7: (ph7, 7, moder7, ot7, ospeedr7, pupdr7, idr7, bs7, br7, afrl, afrl7, Input<Floating>),
    PH8: (ph8, 8, moder8, ot8, ospeedr8, pupdr8, idr8, bs8, br8, afrh, afrh8, Input<Floating>),
    PH9: (ph9, 9, moder9, ot9, ospeedr9, pupdr9, idr9, bs9, br9, afrh, afrh9, Input<Floating>),
    PH10: (ph10, 10, moder10, ot10, ospeedr10, pupdr10, idr10, bs10, br10, afrh, afrh10, Input<Floating>),
    PH11: (ph11, 11, moder11, ot11, ospeedr11, pupdr11, idr11, bs11, br11, afrh, afrh11, Input<Floating>),
    PH12: (ph12, 12, moder12, ot12, ospeedr12, pupdr12, idr12, bs12, br12, afrh, afrh12, Input<Floating>),
    PH13: (ph13, 13, moder13, ot13, ospeedr13, pupdr13, idr13, bs13, br13, afrh, afrh13, Input<Floating>),
    PH14: (ph14, 14, moder14, ot14, ospeedr14, pupdr14, idr14, bs14, br14, afrh, afrh14, Input<Floating>),
    PH15: (ph15, 15, moder15, ot15, ospeedr15, pupdr15, idr15, bs15, br15, afrh, afrh15, Input<Floating>),
]);

#[cfg(any(feature = "stm32f407", feature = "stm32f429"))]
gpio!(GPIOI, gpioi, gpioien, PI, [
    PI0: (pi0, 0, moder0, ot0, ospeedr0, pupdr0, idr0, bs0, br0, afrl, afrl0, Input<Floating>),
    PI1: (pi1, 1, moder1, ot1, ospeedr1, pupdr1, idr1, bs1, br1, afrl, afrl1, Input<Floating>),
    PI2: (pi2, 2, moder2, ot2, ospeedr2, pupdr2, idr2, bs2, br2, afrl, afrl2, Input<Floating>),
    PI3: (pi3, 3, moder3, ot3, ospeedr3, pupdr3, idr3, bs3, br3, afrl, afrl3, Input<Floating>),
    PI4: (pi4, 4, moder4, ot4, ospeedr4, pupdr4, idr4, bs4, br4, afrl, afrl4, Input<Floating>),
    PI5: (pi5, 5, moder5, ot5, ospeedr5, pupdr5, idr5, bs5, br5, afrl, afrl5, Input<Floating>),
    PI6: (pi6, 6, moder6, ot6, ospeedr6, pupdr6, idr6, bs6, br6, afrl, afrl6, Input<Floating>),
    PI7: (pi7, 7, moder7, ot7, ospeedr7, pupdr7, idr7, bs7, br7, afrl, afrl7, Input<Floating>),
    PI8: (pi8, 8, moder8, ot8, ospeedr8, pupdr8, idr8, bs8, br8, afrh, afrh8, Input<Floating>),
    PI9: (pi9, 9, moder9, ot9, ospeedr9, pupdr9, idr9, bs9, br9, afrh, afrh9, Input<Floating>),
    PI10: (pi10, 10, moder10, ot10, ospeedr10, pupdr10, idr10, bs10, br10, afrh, afrh10, Input<Floating>),
    PI11: (pi11, 11, moder11, ot11, ospeedr11, pupdr11, idr11, bs11, br11, afrh, afrh11, Input<Floating>),
    PI12: (pi12, 12, moder12, ot12, ospeedr12, pupdr12, idr12, bs12, br12, afrh, afrh12, Input<Floating>),
    PI13: (pi13, 13, moder13, ot13, ospeedr13, pupdr13, idr13, bs13, br13, afrh, afrh13, Input<Floating>),
    PI14: (pi14, 14, moder14, ot14, ospeedr14, pupdr14, idr14, bs14, br14, afrh, afrh14, Input<Floating>),
    PI15: (pi15, 15, moder15, ot15, ospeedr15, pupdr15, idr15, bs15, br15, afrh, afrh15, Input<Floating>),
]);

/*
gpio!(GPIOJ, gpioj, gpiojen, PJ, [
    PJ0: (pj0, 0, Input<Floating>),
    PJ1: (pj1, 1, Input<Floating>),
    PJ2: (pj2, 2, Input<Floating>),
    PJ3: (pj3, 3, Input<Floating>),
    PJ4: (pj4, 4, Input<Floating>),
    PJ5: (pj5, 5, Input<Floating>),
    PJ6: (pj6, 6, Input<Floating>),
    PJ7: (pj7, 7, Input<Floating>),
    PJ8: (pj8, 8, Input<Floating>),
    PJ9: (pj9, 9, Input<Floating>),
    PJ10: (pj10, 10, Input<Floating>),
    PJ11: (pj11, 11, Input<Floating>),
    PJ12: (pj12, 12, Input<Floating>),
    PJ13: (pj13, 13, Input<Floating>),
    PJ14: (pj14, 14, Input<Floating>),
    PJ15: (pj15, 15, Input<Floating>),
]);

gpio!(GPIOK, gpiok, gpioken, PK, [
    PK0: (pk0, 0, Input<Floating>),
    PK1: (pk1, 1, Input<Floating>),
    PK2: (pk2, 2, Input<Floating>),
    PK3: (pk3, 3, Input<Floating>),
    PK4: (pk4, 4, Input<Floating>),
    PK5: (pk5, 5, Input<Floating>),
    PK6: (pk6, 6, Input<Floating>),
    PK7: (pk7, 7, Input<Floating>),
]);
*/
